'use strict';

const jisho = [
  ["変換前",    "変換後"],

  // 身体 ---------------------
  ["手",        "前足"],
  ["足",        "後ろ足"],
  ["指",        "肉球"],
  ["毛",        "もふもふ"],
  ["女",        "雌"],
  ["男",        "雄"],
  ["人間",      "下僕"],
  ["人",        "猫"],

  // 感情 ---------------------
  ["嬉しい",    "ゴロゴロ…"],
  ["リラックス",    "(サイレントニャー)"],
  ["遊びたい",  "遊びたいあおーん！"],
  ["甘えたい",  "甘えたいクルル"],
  ["仲良く",    "仲良くクルル"],
  ["怒った",    "シャーッ!!(猫パンチ)"],
  ["威嚇",      "シャーッ!!"],
  ["不安",      "不安うみゃー…"],
  ["助けて",    "助けてうみゃー…"],
  ["臭い",      "フレーメン!!"],
  ["ねずみ",    "ねずみ(クククッ)"],
  ["鳥",        "鳥(カカカッ)"],
  ["虫",        "虫(ケケケッ)"],
  ["異性",      "にゃーお"],

  // 嗜好品 ---------------------
  ["酒",        "ミルク"],
  ["たばこ",    "またたび"],
  ["アイス",    "かつお節"],
  ["クッキー",  "カリカリ"],
  ["ケーキ",    "マグロ缶"],
  ["お菓子",    "チュール"],
  ["ギャンブル",    "ねこじゃらし"],
  ["競馬",      "回し車"],
  // ["宝くじ",    ""],
  // ["パチンコ",  ""],
  
  // 物 ---------------------
  ["植物",      "ねこ草"],
  
  // 場所 ---------------------
  ["ジャングルジム",    "キャットタワー"],
  ["運動場",    "キャットタワー"],
  ["ジム",      "キャットタワー"],
  ["洗面所",    "水飲み場"],
  ["サウナ",    "こたつの中"],
  ["会社",      "サボる場所"],
  ["学校",      "遊ぶ場所"],
  
  // 行為 ---------------------
  ["仕事",      "在宅ワーク"],
  // ["残業",      ""],
  // ["勉強",      ""],
  // ["宿題",      ""],
  ["給料",      "不労所得"],
  ["運動",      "ねこじゃらし"],
  ["攻撃",      "猫パンチ"],
  ["喧嘩",      "キャットファイト"],
  
  // 乗り物 ---------------------
  ["自動車",    "ルンバ"],
  ["自転車",    "手動ルンバ"],
  ["バス",      "相乗りルンバ"],
  ["列車",      "連結ルンバ"],
  ["新幹線",    "高速連結ルンバ"],
  
  // ことわざ ---------------------
  ["神様",      "ﾈｺ様"],
  ["お金",      "小判"],
  ["迷子",      "迷子の子猫ちゃん"],
  ["警察",      "犬のお巡りさん"],
  ["無駄",      "猫に小判"],
  ["鏡",        "「鏡よ、鏡よ、鏡さん。世界で一番かわいいのはネコ!!」"],
  ["ネコ",      "ネ申"],

  // にゃ ---------------------
  ["な",        "にゃ"],
  ["2",         "にゃー(2)"],
  ["7",         "にゃにゃ(7)"],

];

export default jisho;

